Revit 2027 API
CurveByPointsUtils.GetProjectionType Method
 Gets the projection type of the CurveElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static CurveProjectionType GetProjectionType(
	CurveElement curveElem
)
Public Shared Function GetProjectionType (
	curveElem As CurveElement
) As CurveProjectionType
public:
static CurveProjectionType GetProjectionType(
	CurveElement^ curveElem
)
static member GetProjectionType :
        curveElem : CurveElement -> CurveProjectionType
Parameters
curveElem CurveElement
 The CurveElement.
Return Value
CurveProjectionType
 The projection type.
Exceptions
Exception | Condition
ArgumentException |  The input CurveElement is not a CurveByPoints.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CurveByPointsUtils Class
Autodesk.Revit.DB Namespace